{
  "architectures": [
    "JinaEmbeddingsV5Model"
  ],
  "task_names": ["retrieval", "text-matching", "clustering", "classification"],
  "auto_map": {
    "AutoConfig": "configuration_jina_embeddings_v5.JinaEmbeddingsV5Config",
    "AutoModel": "modeling_jina_embeddings_v5.JinaEmbeddingsV5Model"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token": "<|begin_of_text|>",
  "bos_token_id": 128000,
  "eos_token": "<|end_of_text|>",
  "eos_token_id": 128001,
  "pad_token": "<|end_of_text|>",
  "pad_token_id": 128001,
  "mask_token": "<|mask|>",
  "mask_token_id": 128002,
  "hidden_act": "silu",
  "hidden_dropout": 0.0,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "max_position_embeddings": 8192,
  "model_type": "jina_embeddings_v5",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_key_value_heads": 12,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.40.0.dev0",
  "vocab_size": 128256,
  "is_decoder": false
}